In [2]:
import numpy as np
import pandas as pd
from numpy.random import randn
my_data=randn(4,3)# rows and columns
my_rows=["A","B","C","D"]
my_cols=["Monday","Tuesday","Friday"]

In [3]:
df1=pd.DataFrame(my_data,my_rows,my_cols)

     Monday   Tuesday    Friday
A  0.873354 -0.106816 -0.599459
B  0.316026 -1.942795  0.427624
C  0.595798 -0.293567  0.759996
D -0.118678  0.267373  0.536891

In [19]:
#import
df2=pd.read_csv('data.csv')
df2

     name  colour  number
0   emily    blue     234
1   jason   green     345
2   jacob   white     567
3    jack  purple     678
4    emma  yellow     789
5  justin  orange     547
6    rust   black     354
7     rue   brown     232
8   hilda    grey     653
9  carmen  silver     323

In [20]:
df2.loc[[1,5]]

     name  colour  number
1   jason   green     345
5  justin  orange     547

In [22]:
#rows from top
df2.head(4)

    name  colour  number
0  emily    blue     234
1  jason   green     345
2  jacob   white     567
3   jack  purple     678

In [23]:
#rows form bottom
df2.tail(5)

     name  colour  number
5  justin  orange     547
6    rust   black     354
7     rue   brown     232
8   hilda    grey     653
9  carmen  silver     323

In [24]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    10 non-null     object
 1   colour  10 non-null     object
 2   number  10 non-null     int64
dtypes: int64(1), object(2)
memory usage: 372.0+ bytes

In [25]:
df2.shape

(10, 3)

In [26]:
df2.ndim

2

In [27]:
df2.dtypes

name      object
colour    object
number     int64
dtype: object

In [28]:
df2.describe(
    
)

           number
count   10.000000
mean   472.200000
std    199.118502
min    232.000000
25%    328.500000
50%    450.500000
75%    631.500000
max    789.000000

In [31]:
df2['name'].describe()

count        10
unique       10
top       emily
freq          1
Name: name, dtype: object

In [33]:
df2['colour']

0      blue
1     green
2     white
3    purple
4    yellow
5    orange
6     black
7     brown
8      grey
9    silver
Name: colour, dtype: object

In [34]:
df2.name

0     emily
1     jason
2     jacob
3      jack
4      emma
5    justin
6      rust
7       rue
8     hilda
9    carmen
Name: name, dtype: object

In [37]:
df2.iloc[:,2]

0    234
1    345
2    567
3    678
4    789
5    547
6    354
7    232
8    653
9    323
Name: number, dtype: int64